Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Загрузка штрихкодов из регистра сведений при открытии существующего элемента
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗагрузитьШтрихкодыИзРегистра();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Проверка уникальности штрихкодов
	Если Не ПроверитьУникальностьШтрихкодов() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Синхронизация штрихкодов с регистром сведений
	СинхронизироватьШтрихкодыСРегистром(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиШтрихкоды

&НаКлиенте
Процедура ШтрихкодыШтрихкодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Штрихкоды.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Убираем пробелы
	Если Не ПустаяСтрока(ТекущиеДанные.Штрихкод) Тогда
		ТекущиеДанные.Штрихкод = СокрЛП(ТекущиеДанные.Штрихкод);
	КонецЕсли;
	
	// Проверка уникальности при изменении
	ПроверитьУникальностьШтрихкодаВТЧ(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ШтрихкодыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Штрихкоды.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Если штрихкод пустой, удаляем без подтверждения
	Если ПустаяСтрока(СокрЛП(ТекущиеДанные.Штрихкод)) Тогда
		Возврат;
	КонецЕсли;
	
	// Запрашиваем подтверждение удаления
	Результат = Ждать ВопросАсинх(
		СтрШаблон("Удалить штрихкод ""%1""?", ТекущиеДанные.Штрихкод),
		РежимДиалогаВопрос.ДаНет);
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// При копировании очищаем штрихкод, чтобы избежать дублирования
	Если Копирование Тогда
		ТекущиеДанные = Элементы.Штрихкоды.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.Штрихкод = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьУникальностьШтрихкодаВТЧ(ТекущаяСтрока)
	
	// Проверяем только если штрихкод заполнен
	Если ПустаяСтрока(СокрЛП(ТекущаяСтрока.Штрихкод)) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверяемыйШтрихкод = ВРег(СокрЛП(ТекущаяСтрока.Штрихкод));
	
	// Проверяем дублирование в табличной части
	Для Каждого СтрокаТЧ Из Объект.Штрихкоды Цикл
		
		// Пропускаем текущую строку
		Если СтрокаТЧ = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(СокрЛП(СтрокаТЧ.Штрихкод)) Тогда
			Продолжить;
		КонецЕсли;
		
		// Сравниваем штрихкоды
		Если ВРег(СокрЛП(СтрокаТЧ.Штрихкод)) = ПроверяемыйШтрихкод Тогда
			
			ПоказатьПредупреждение(,
				СтрШаблон("Штрихкод ""%1"" уже добавлен в список!", ТекущаяСтрока.Штрихкод));
			
			// Очищаем дублирующийся штрихкод
			ТекущаяСтрока.Штрихкод = "";
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьШтрихкодыИзРегистра()
	
	// Очищаем табличную часть перед загрузкой
	Объект.Штрихкоды.Очистить();
	
	// Запрашиваем штрихкоды из регистра сведений
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	// Заполняем табличную часть данными из регистра
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Штрихкоды.Добавить();
		НоваяСтрока.Штрихкод = Выборка.Штрихкод;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьШтрихкодыСРегистром(СсылкаНоменклатуры)
	
	// Начинаем транзакцию для атомарности операции
	НачатьТранзакцию();
	
	Попытка
		
		// Шаг 1: Удаляем все существующие записи для данной номенклатуры
		НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(СсылкаНоменклатуры);
		НаборЗаписей.Записать();
		
		// Шаг 2: Добавляем новые записи из табличной части
		Для Каждого СтрокаТЧ Из Объект.Штрихкоды Цикл
			
			// Пропускаем пустые штрихкоды
			Если ПустаяСтрока(СокрЛП(СтрокаТЧ.Штрихкод)) Тогда
				Продолжить;
			КонецЕсли;
			
			// Создаем новую запись в регистре
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Штрихкод = СокрЛП(СтрокаТЧ.Штрихкод);
			НоваяЗапись.Номенклатура = СсылкаНоменклатуры;
			
		КонецЦикла;
		
		// Записываем набор записей
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при синхронизации штрихкодов: " + ТекстОшибки;
		Сообщение.Сообщить();
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьУникальностьШтрихкодов()
	
	// Проверка на дублирование штрихкодов внутри табличной части
	СписокШтрихкодов = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из Объект.Штрихкоды Цикл
		
		// Пропускаем пустые штрихкоды
		Если ПустаяСтрока(СокрЛП(СтрокаТЧ.Штрихкод)) Тогда
			Продолжить;
		КонецЕсли;
		
		Штрихкод = СокрЛП(СтрокаТЧ.Штрихкод);
		
		// Проверяем дубликаты внутри ТЧ
		Если СписокШтрихкодов[Штрихкод] <> Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Штрихкод ""%1"" дублируется в таблице!", Штрихкод);
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;
		
		СписокШтрихкодов.Вставить(Штрихкод, Истина);
		
	КонецЦикла;
	
	// Проверка на существование штрихкода у другой номенклатуры
	Для Каждого СтрокаТЧ Из Объект.Штрихкоды Цикл
		
		Если ПустаяСтрока(СокрЛП(СтрокаТЧ.Штрихкод)) Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Номенклатура КАК Номенклатура
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК Штрихкоды
			|ГДЕ
			|	Штрихкоды.Штрихкод = &Штрихкод
			|	И Штрихкоды.Номенклатура <> &ТекущаяНоменклатура";
		
		Запрос.УстановитьПараметр("Штрихкод", СокрЛП(СтрокаТЧ.Штрихкод));
		Запрос.УстановитьПараметр("ТекущаяНоменклатура", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(
				"Штрихкод ""%1"" уже используется для номенклатуры ""%2""!",
				СокрЛП(СтрокаТЧ.Штрихкод),
				Выборка.Номенклатура);
			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
